// TODO: заменить на полный справочник частей/пунктов УК РФ после загрузки текста УК.
export const ukArticles = [{'id': '105', 'label': 'Статья 105 УК РФ', 'parts': [{'id': '1', 'label': 'ч. 1'}, {'id': '2', 'label': 'ч. 2'}]}, {'id': '106', 'label': 'Статья 106 УК РФ', 'parts': []}, {'id': '107', 'label': 'Статья 107 УК РФ', 'parts': []}, {'id': '108', 'label': 'Статья 108 УК РФ', 'parts': []}, {'id': '109', 'label': 'Статья 109 УК РФ', 'parts': []}, {'id': '110', 'label': 'Статья 110 УК РФ', 'parts': []}, {'id': '111', 'label': 'Статья 111 УК РФ', 'parts': []}, {'id': '112', 'label': 'Статья 112 УК РФ', 'parts': []}, {'id': '113', 'label': 'Статья 113 УК РФ', 'parts': []}, {'id': '114', 'label': 'Статья 114 УК РФ', 'parts': []}, {'id': '115', 'label': 'Статья 115 УК РФ', 'parts': []}, {'id': '116', 'label': 'Статья 116 УК РФ', 'parts': []}, {'id': '117', 'label': 'Статья 117 УК РФ', 'parts': []}, {'id': '118', 'label': 'Статья 118 УК РФ', 'parts': []}, {'id': '119', 'label': 'Статья 119 УК РФ', 'parts': []}, {'id': '120', 'label': 'Статья 120 УК РФ', 'parts': []}, {'id': '121', 'label': 'Статья 121 УК РФ', 'parts': []}, {'id': '122', 'label': 'Статья 122 УК РФ', 'parts': []}, {'id': '123', 'label': 'Статья 123 УК РФ', 'parts': []}, {'id': '124', 'label': 'Статья 124 УК РФ', 'parts': []}, {'id': '125', 'label': 'Статья 125 УК РФ', 'parts': []}, {'id': '126', 'label': 'Статья 126 УК РФ', 'parts': []}, {'id': '127', 'label': 'Статья 127 УК РФ', 'parts': []}, {'id': '128', 'label': 'Статья 128 УК РФ', 'parts': []}, {'id': '129', 'label': 'Статья 129 УК РФ', 'parts': []}, {'id': '130', 'label': 'Статья 130 УК РФ', 'parts': []}, {'id': '131', 'label': 'Статья 131 УК РФ', 'parts': []}, {'id': '132', 'label': 'Статья 132 УК РФ', 'parts': []}, {'id': '133', 'label': 'Статья 133 УК РФ', 'parts': []}, {'id': '134', 'label': 'Статья 134 УК РФ', 'parts': []}, {'id': '135', 'label': 'Статья 135 УК РФ', 'parts': []}, {'id': '136', 'label': 'Статья 136 УК РФ', 'parts': []}, {'id': '137', 'label': 'Статья 137 УК РФ', 'parts': []}, {'id': '138', 'label': 'Статья 138 УК РФ', 'parts': []}, {'id': '139', 'label': 'Статья 139 УК РФ', 'parts': []}, {'id': '140', 'label': 'Статья 140 УК РФ', 'parts': []}, {'id': '141', 'label': 'Статья 141 УК РФ', 'parts': []}, {'id': '142', 'label': 'Статья 142 УК РФ', 'parts': []}, {'id': '143', 'label': 'Статья 143 УК РФ', 'parts': []}, {'id': '144', 'label': 'Статья 144 УК РФ', 'parts': []}, {'id': '145', 'label': 'Статья 145 УК РФ', 'parts': []}, {'id': '146', 'label': 'Статья 146 УК РФ', 'parts': []}, {'id': '147', 'label': 'Статья 147 УК РФ', 'parts': []}, {'id': '148', 'label': 'Статья 148 УК РФ', 'parts': []}, {'id': '149', 'label': 'Статья 149 УК РФ', 'parts': []}, {'id': '150', 'label': 'Статья 150 УК РФ', 'parts': []}, {'id': '151', 'label': 'Статья 151 УК РФ', 'parts': []}, {'id': '152', 'label': 'Статья 152 УК РФ', 'parts': []}, {'id': '153', 'label': 'Статья 153 УК РФ', 'parts': []}, {'id': '154', 'label': 'Статья 154 УК РФ', 'parts': []}, {'id': '155', 'label': 'Статья 155 УК РФ', 'parts': []}, {'id': '156', 'label': 'Статья 156 УК РФ', 'parts': []}, {'id': '157', 'label': 'Статья 157 УК РФ', 'parts': []}, {'id': '158', 'label': 'Статья 158 УК РФ', 'parts': [{'id': '1', 'label': 'ч. 1'}, {'id': '2', 'label': 'ч. 2'}, {'id': '3', 'label': 'ч. 3'}, {'id': '4', 'label': 'ч. 4'}]}, {'id': '159', 'label': 'Статья 159 УК РФ', 'parts': []}, {'id': '160', 'label': 'Статья 160 УК РФ', 'parts': []}, {'id': '161', 'label': 'Статья 161 УК РФ', 'parts': []}, {'id': '162', 'label': 'Статья 162 УК РФ', 'parts': []}, {'id': '163', 'label': 'Статья 163 УК РФ', 'parts': []}, {'id': '164', 'label': 'Статья 164 УК РФ', 'parts': []}, {'id': '165', 'label': 'Статья 165 УК РФ', 'parts': []}, {'id': '166', 'label': 'Статья 166 УК РФ', 'parts': []}, {'id': '167', 'label': 'Статья 167 УК РФ', 'parts': []}, {'id': '168', 'label': 'Статья 168 УК РФ', 'parts': []}, {'id': '169', 'label': 'Статья 169 УК РФ', 'parts': []}, {'id': '170', 'label': 'Статья 170 УК РФ', 'parts': []}, {'id': '171', 'label': 'Статья 171 УК РФ', 'parts': []}, {'id': '172', 'label': 'Статья 172 УК РФ', 'parts': []}, {'id': '173', 'label': 'Статья 173 УК РФ', 'parts': []}, {'id': '174', 'label': 'Статья 174 УК РФ', 'parts': []}, {'id': '175', 'label': 'Статья 175 УК РФ', 'parts': []}, {'id': '176', 'label': 'Статья 176 УК РФ', 'parts': []}, {'id': '177', 'label': 'Статья 177 УК РФ', 'parts': []}, {'id': '178', 'label': 'Статья 178 УК РФ', 'parts': []}, {'id': '179', 'label': 'Статья 179 УК РФ', 'parts': []}, {'id': '180', 'label': 'Статья 180 УК РФ', 'parts': []}, {'id': '181', 'label': 'Статья 181 УК РФ', 'parts': []}, {'id': '182', 'label': 'Статья 182 УК РФ', 'parts': []}, {'id': '183', 'label': 'Статья 183 УК РФ', 'parts': []}, {'id': '184', 'label': 'Статья 184 УК РФ', 'parts': []}, {'id': '185', 'label': 'Статья 185 УК РФ', 'parts': []}, {'id': '186', 'label': 'Статья 186 УК РФ', 'parts': []}, {'id': '187', 'label': 'Статья 187 УК РФ', 'parts': []}, {'id': '188', 'label': 'Статья 188 УК РФ', 'parts': []}, {'id': '189', 'label': 'Статья 189 УК РФ', 'parts': []}, {'id': '190', 'label': 'Статья 190 УК РФ', 'parts': []}, {'id': '191', 'label': 'Статья 191 УК РФ', 'parts': []}, {'id': '192', 'label': 'Статья 192 УК РФ', 'parts': []}, {'id': '193', 'label': 'Статья 193 УК РФ', 'parts': []}, {'id': '194', 'label': 'Статья 194 УК РФ', 'parts': []}, {'id': '195', 'label': 'Статья 195 УК РФ', 'parts': []}, {'id': '196', 'label': 'Статья 196 УК РФ', 'parts': []}, {'id': '197', 'label': 'Статья 197 УК РФ', 'parts': []}, {'id': '198', 'label': 'Статья 198 УК РФ', 'parts': []}, {'id': '199', 'label': 'Статья 199 УК РФ', 'parts': []}, {'id': '200', 'label': 'Статья 200 УК РФ', 'parts': []}, {'id': '201', 'label': 'Статья 201 УК РФ', 'parts': []}, {'id': '202', 'label': 'Статья 202 УК РФ', 'parts': []}, {'id': '203', 'label': 'Статья 203 УК РФ', 'parts': []}, {'id': '204', 'label': 'Статья 204 УК РФ', 'parts': []}, {'id': '205', 'label': 'Статья 205 УК РФ', 'parts': []}, {'id': '206', 'label': 'Статья 206 УК РФ', 'parts': []}, {'id': '207', 'label': 'Статья 207 УК РФ', 'parts': []}, {'id': '208', 'label': 'Статья 208 УК РФ', 'parts': []}, {'id': '209', 'label': 'Статья 209 УК РФ', 'parts': []}, {'id': '210', 'label': 'Статья 210 УК РФ', 'parts': []}, {'id': '211', 'label': 'Статья 211 УК РФ', 'parts': []}, {'id': '212', 'label': 'Статья 212 УК РФ', 'parts': []}, {'id': '213', 'label': 'Статья 213 УК РФ', 'parts': []}, {'id': '214', 'label': 'Статья 214 УК РФ', 'parts': []}, {'id': '215', 'label': 'Статья 215 УК РФ', 'parts': []}, {'id': '216', 'label': 'Статья 216 УК РФ', 'parts': []}, {'id': '217', 'label': 'Статья 217 УК РФ', 'parts': []}, {'id': '218', 'label': 'Статья 218 УК РФ', 'parts': []}, {'id': '219', 'label': 'Статья 219 УК РФ', 'parts': []}, {'id': '220', 'label': 'Статья 220 УК РФ', 'parts': []}, {'id': '221', 'label': 'Статья 221 УК РФ', 'parts': []}, {'id': '222', 'label': 'Статья 222 УК РФ', 'parts': []}, {'id': '223', 'label': 'Статья 223 УК РФ', 'parts': []}, {'id': '224', 'label': 'Статья 224 УК РФ', 'parts': []}, {'id': '225', 'label': 'Статья 225 УК РФ', 'parts': []}, {'id': '226', 'label': 'Статья 226 УК РФ', 'parts': []}, {'id': '227', 'label': 'Статья 227 УК РФ', 'parts': []}, {'id': '228', 'label': 'Статья 228 УК РФ', 'parts': [{'id': '1', 'label': 'ч. 1'}, {'id': '2', 'label': 'ч. 2'}, {'id': '3', 'label': 'ч. 3'}]}, {'id': '229', 'label': 'Статья 229 УК РФ', 'parts': []}, {'id': '230', 'label': 'Статья 230 УК РФ', 'parts': []}, {'id': '231', 'label': 'Статья 231 УК РФ', 'parts': []}, {'id': '232', 'label': 'Статья 232 УК РФ', 'parts': []}, {'id': '233', 'label': 'Статья 233 УК РФ', 'parts': []}, {'id': '234', 'label': 'Статья 234 УК РФ', 'parts': []}, {'id': '235', 'label': 'Статья 235 УК РФ', 'parts': []}, {'id': '236', 'label': 'Статья 236 УК РФ', 'parts': []}, {'id': '237', 'label': 'Статья 237 УК РФ', 'parts': []}, {'id': '238', 'label': 'Статья 238 УК РФ', 'parts': []}, {'id': '239', 'label': 'Статья 239 УК РФ', 'parts': []}, {'id': '240', 'label': 'Статья 240 УК РФ', 'parts': []}, {'id': '241', 'label': 'Статья 241 УК РФ', 'parts': []}, {'id': '242', 'label': 'Статья 242 УК РФ', 'parts': []}, {'id': '243', 'label': 'Статья 243 УК РФ', 'parts': []}, {'id': '244', 'label': 'Статья 244 УК РФ', 'parts': []}, {'id': '245', 'label': 'Статья 245 УК РФ', 'parts': []}, {'id': '246', 'label': 'Статья 246 УК РФ', 'parts': []}, {'id': '247', 'label': 'Статья 247 УК РФ', 'parts': []}, {'id': '248', 'label': 'Статья 248 УК РФ', 'parts': []}, {'id': '249', 'label': 'Статья 249 УК РФ', 'parts': []}, {'id': '250', 'label': 'Статья 250 УК РФ', 'parts': []}, {'id': '251', 'label': 'Статья 251 УК РФ', 'parts': []}, {'id': '252', 'label': 'Статья 252 УК РФ', 'parts': []}, {'id': '253', 'label': 'Статья 253 УК РФ', 'parts': []}, {'id': '254', 'label': 'Статья 254 УК РФ', 'parts': []}, {'id': '255', 'label': 'Статья 255 УК РФ', 'parts': []}, {'id': '256', 'label': 'Статья 256 УК РФ', 'parts': []}, {'id': '257', 'label': 'Статья 257 УК РФ', 'parts': []}, {'id': '258', 'label': 'Статья 258 УК РФ', 'parts': []}, {'id': '259', 'label': 'Статья 259 УК РФ', 'parts': []}, {'id': '260', 'label': 'Статья 260 УК РФ', 'parts': []}, {'id': '261', 'label': 'Статья 261 УК РФ', 'parts': []}, {'id': '262', 'label': 'Статья 262 УК РФ', 'parts': []}, {'id': '263', 'label': 'Статья 263 УК РФ', 'parts': []}, {'id': '264', 'label': 'Статья 264 УК РФ', 'parts': []}, {'id': '265', 'label': 'Статья 265 УК РФ', 'parts': []}, {'id': '266', 'label': 'Статья 266 УК РФ', 'parts': []}, {'id': '267', 'label': 'Статья 267 УК РФ', 'parts': []}, {'id': '268', 'label': 'Статья 268 УК РФ', 'parts': []}, {'id': '269', 'label': 'Статья 269 УК РФ', 'parts': []}, {'id': '270', 'label': 'Статья 270 УК РФ', 'parts': []}, {'id': '271', 'label': 'Статья 271 УК РФ', 'parts': []}, {'id': '272', 'label': 'Статья 272 УК РФ', 'parts': []}, {'id': '273', 'label': 'Статья 273 УК РФ', 'parts': []}, {'id': '274', 'label': 'Статья 274 УК РФ', 'parts': []}, {'id': '275', 'label': 'Статья 275 УК РФ', 'parts': []}, {'id': '276', 'label': 'Статья 276 УК РФ', 'parts': []}, {'id': '277', 'label': 'Статья 277 УК РФ', 'parts': []}, {'id': '278', 'label': 'Статья 278 УК РФ', 'parts': []}, {'id': '279', 'label': 'Статья 279 УК РФ', 'parts': []}, {'id': '280', 'label': 'Статья 280 УК РФ', 'parts': []}, {'id': '281', 'label': 'Статья 281 УК РФ', 'parts': []}, {'id': '282', 'label': 'Статья 282 УК РФ', 'parts': []}, {'id': '283', 'label': 'Статья 283 УК РФ', 'parts': []}, {'id': '284', 'label': 'Статья 284 УК РФ', 'parts': []}, {'id': '285', 'label': 'Статья 285 УК РФ', 'parts': []}, {'id': '286', 'label': 'Статья 286 УК РФ', 'parts': []}, {'id': '287', 'label': 'Статья 287 УК РФ', 'parts': []}, {'id': '288', 'label': 'Статья 288 УК РФ', 'parts': []}, {'id': '289', 'label': 'Статья 289 УК РФ', 'parts': []}, {'id': '290', 'label': 'Статья 290 УК РФ', 'parts': []}, {'id': '291', 'label': 'Статья 291 УК РФ', 'parts': []}, {'id': '292', 'label': 'Статья 292 УК РФ', 'parts': []}, {'id': '293', 'label': 'Статья 293 УК РФ', 'parts': []}, {'id': '294', 'label': 'Статья 294 УК РФ', 'parts': []}, {'id': '295', 'label': 'Статья 295 УК РФ', 'parts': []}, {'id': '296', 'label': 'Статья 296 УК РФ', 'parts': []}, {'id': '297', 'label': 'Статья 297 УК РФ', 'parts': []}, {'id': '298', 'label': 'Статья 298 УК РФ', 'parts': []}, {'id': '299', 'label': 'Статья 299 УК РФ', 'parts': []}, {'id': '300', 'label': 'Статья 300 УК РФ', 'parts': []}, {'id': '301', 'label': 'Статья 301 УК РФ', 'parts': []}, {'id': '302', 'label': 'Статья 302 УК РФ', 'parts': []}, {'id': '303', 'label': 'Статья 303 УК РФ', 'parts': []}, {'id': '304', 'label': 'Статья 304 УК РФ', 'parts': []}, {'id': '305', 'label': 'Статья 305 УК РФ', 'parts': []}, {'id': '306', 'label': 'Статья 306 УК РФ', 'parts': []}, {'id': '307', 'label': 'Статья 307 УК РФ', 'parts': []}, {'id': '308', 'label': 'Статья 308 УК РФ', 'parts': []}, {'id': '309', 'label': 'Статья 309 УК РФ', 'parts': []}, {'id': '310', 'label': 'Статья 310 УК РФ', 'parts': []}, {'id': '311', 'label': 'Статья 311 УК РФ', 'parts': []}, {'id': '312', 'label': 'Статья 312 УК РФ', 'parts': []}, {'id': '313', 'label': 'Статья 313 УК РФ', 'parts': []}, {'id': '314', 'label': 'Статья 314 УК РФ', 'parts': []}, {'id': '315', 'label': 'Статья 315 УК РФ', 'parts': []}, {'id': '316', 'label': 'Статья 316 УК РФ', 'parts': []}, {'id': '317', 'label': 'Статья 317 УК РФ', 'parts': []}, {'id': '318', 'label': 'Статья 318 УК РФ', 'parts': []}, {'id': '319', 'label': 'Статья 319 УК РФ', 'parts': []}, {'id': '320', 'label': 'Статья 320 УК РФ', 'parts': []}, {'id': '321', 'label': 'Статья 321 УК РФ', 'parts': []}, {'id': '322', 'label': 'Статья 322 УК РФ', 'parts': []}, {'id': '323', 'label': 'Статья 323 УК РФ', 'parts': []}, {'id': '324', 'label': 'Статья 324 УК РФ', 'parts': []}, {'id': '325', 'label': 'Статья 325 УК РФ', 'parts': []}, {'id': '326', 'label': 'Статья 326 УК РФ', 'parts': []}, {'id': '327', 'label': 'Статья 327 УК РФ', 'parts': []}, {'id': '328', 'label': 'Статья 328 УК РФ', 'parts': []}, {'id': '329', 'label': 'Статья 329 УК РФ', 'parts': []}, {'id': '330', 'label': 'Статья 330 УК РФ', 'parts': []}, {'id': '331', 'label': 'Статья 331 УК РФ', 'parts': []}, {'id': '332', 'label': 'Статья 332 УК РФ', 'parts': []}, {'id': '333', 'label': 'Статья 333 УК РФ', 'parts': []}, {'id': '334', 'label': 'Статья 334 УК РФ', 'parts': []}, {'id': '335', 'label': 'Статья 335 УК РФ', 'parts': []}, {'id': '336', 'label': 'Статья 336 УК РФ', 'parts': []}, {'id': '337', 'label': 'Статья 337 УК РФ', 'parts': []}, {'id': '338', 'label': 'Статья 338 УК РФ', 'parts': []}, {'id': '339', 'label': 'Статья 339 УК РФ', 'parts': []}, {'id': '340', 'label': 'Статья 340 УК РФ', 'parts': []}, {'id': '341', 'label': 'Статья 341 УК РФ', 'parts': []}, {'id': '342', 'label': 'Статья 342 УК РФ', 'parts': []}, {'id': '343', 'label': 'Статья 343 УК РФ', 'parts': []}, {'id': '344', 'label': 'Статья 344 УК РФ', 'parts': []}, {'id': '345', 'label': 'Статья 345 УК РФ', 'parts': []}, {'id': '346', 'label': 'Статья 346 УК РФ', 'parts': []}, {'id': '347', 'label': 'Статья 347 УК РФ', 'parts': []}, {'id': '348', 'label': 'Статья 348 УК РФ', 'parts': []}, {'id': '349', 'label': 'Статья 349 УК РФ', 'parts': []}, {'id': '350', 'label': 'Статья 350 УК РФ', 'parts': []}, {'id': '351', 'label': 'Статья 351 УК РФ', 'parts': []}, {'id': '352', 'label': 'Статья 352 УК РФ', 'parts': []}, {'id': '353', 'label': 'Статья 353 УК РФ', 'parts': []}, {'id': '354', 'label': 'Статья 354 УК РФ', 'parts': []}, {'id': '355', 'label': 'Статья 355 УК РФ', 'parts': []}, {'id': '356', 'label': 'Статья 356 УК РФ', 'parts': []}, {'id': '357', 'label': 'Статья 357 УК РФ', 'parts': []}, {'id': '358', 'label': 'Статья 358 УК РФ', 'parts': []}, {'id': '359', 'label': 'Статья 359 УК РФ', 'parts': []}, {'id': '360', 'label': 'Статья 360 УК РФ', 'parts': []}, {'id': '361', 'label': 'Статья 361 УК РФ', 'parts': []}];

export const crimeCategories = [
  'небольшой тяжести',
  'средней тяжести',
  'тяжкое',
  'особо тяжкое'
];

export const intentTypes = ['умышленное', 'неосторожное'];

export const punishmentTypes = [
  {
    id: 'fine',
    label: 'Штраф',
    primary: true,
    additional: true
  },
  {
    id: 'ban-position',
    label: 'Лишение права занимать должности/деятельность',
    primary: true,
    additional: true
  },
  {
    id: 'deprivation-title',
    label: 'Лишение специального звания/наград',
    primary: false,
    additional: true
  },
  {
    id: 'mandatory-work',
    label: 'Обязательные работы',
    primary: true,
    additional: false
  },
  {
    id: 'correctional-work',
    label: 'Исправительные работы',
    primary: true,
    additional: false
  },
  {
    id: 'military-restriction',
    label: 'Ограничение по военной службе',
    primary: true,
    additional: false
  },
  {
    id: 'restriction-liberty',
    label: 'Ограничение свободы',
    primary: true,
    additional: true
  },
  {
    id: 'forced-labor',
    label: 'Принудительные работы',
    primary: true,
    additional: false
  },
  {
    id: 'arrest',
    label: 'Арест',
    primary: true,
    additional: false
  },
  {
    id: 'disciplinary-unit',
    label: 'Содержание в дисциплинарной воинской части',
    primary: true,
    additional: false
  },
  {
    id: 'imprisonment',
    label: 'Лишение свободы на срок',
    primary: true,
    additional: false
  },
  {
    id: 'life-imprisonment',
    label: 'Пожизненное лишение свободы',
    primary: true,
    additional: false
  },
  {
    id: 'death-penalty',
    label: 'Смертная казнь',
    primary: true,
    additional: false
  }
];
